#include <stdio.h>
#include <windows.h>
#include "functions.h"


int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    diseases_read();
    medications_read();
    int menu;
    do
    {
        printf("===============================================================\n");
        printf("|\033[1;34m---------------------------- МЕНЮ ---------------------------\033[1;37m|\n");
        printf("===============================================================\n");
        printf("| \033[1;34m 1.\033[1;37m Додати нову хворобу.      |  \033[1;34m 7.\033[1;37m Коригувати запаси.     |\n");
        printf("---------------------------------------------------------------\n");
        printf("| \033[1;34m 2.\033[1;37m Додати медикаменти.       |  \033[1;34m 8.\033[1;37m Сортувати хвороби.     |\n");
        printf("---------------------------------------------------------------\n");
        printf("| \033[1;34m 3.\033[1;37m Переглянути хвороби.      |  \033[1;34m 9.\033[1;37m Сортувати медикаменти. |\n");
        printf("---------------------------------------------------------------\n");
        printf("| \033[1;34m 4.\033[1;37m Переглянути медикаменти.  |  \033[1;34m10.\033[1;37m Видалити хворобу.      |\n");
        printf("---------------------------------------------------------------\n");
        printf("| \033[1;34m 5.\033[1;37m Знайти хвороби.           |  \033[1;34m11.\033[1;37m Видалити медикамент.   |\n");
        printf("---------------------------------------------------------------\n");
        printf("| \033[1;34m 6.\033[1;37m Знайти медикаменти.       |  \033[1;34m12.\033[1;37m Зберегти та вийти.     |\n");
        printf("===============================================================\n");
        printf("\033[1;30mОберіть пункт: \033[1;37m");
        scanf_s("%d", &menu);

        switch (menu)
        {
        case 1:
            disease_add(); break;
        case 2:
            medication_add(); break;
        case 3:
            diseases_display(); break;
        case 4:
            medications_display(); break;
        case 5:
            disease_find(); break;
        case 6:
            medications_find(); break;
        case 7:
            adjust_quantity(); break;
        case 8:
            disease_sort(); break;
        case 9:
            medications_sort(); break;
        case 10:
            disease_delete(); break;
        case 11:
            medication_delete(); break;
        case 12:
            diseases_save();
            medications_save();
            printf("\033[1;32mРоботу завершено.\033[1;37m\n"); break;
        default:
            printf("\033[1;31mНевірний вибір. Спробуйте ще раз.\033[1;37m\n");
        }
    } while (menu != 12);

    return 0;
}
